app/Http/Controllers/PagesController.php

    public function home()
    {
        $messages = Message::paginate(10);
---
select * from `messages` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `messages`